# zsh and extensions
brew "zsh"
brew "zsh-completion"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# terminal programs
brew "tmux"
brew "neovim"

# tools
brew "jq"
brew "yq"
brew "fzf"
brew "bat"
brew "watch"
brew "direnv"
brew "ripgrep"
brew "pyenv"

# applications
cask "karabiner-elements"
cask "kitty"
cask "1password"
cask "1password-cli"

# load any machine specific Homebrew formulae
# see https://github.com/Homebrew/homebrew-bundle/issues/521#issuecomment-509023309
instance_eval(File.read(ENV["HOME"] + "/.Brewfile.local"))
